Res-social/Res-firecracker-random-v1/firecracker_t_4_c_6_readUserTimeline_composeVcpu_2_wrkVcpu_2/wrk.txt
Running 1m test @ http://nginx-thrift:8080/wrk2-api/user-timeline/read
  4 threads and 6 connections
  Thread calibration: mean lat.: 5172.956ms, rate sampling interval: 18006ms
  Thread calibration: mean lat.: 5109.774ms, rate sampling interval: 18038ms
  Thread calibration: mean lat.: 5209.279ms, rate sampling interval: 18202ms
  Thread calibration: mean lat.: 5140.021ms, rate sampling interval: 18006ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    25.29s     9.47s   39.45s    49.65%
    Req/Sec   168.50      2.96   173.00     75.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   26.41s 
 75.000%   34.44s 
 90.000%   37.55s 
 99.000%   39.45s 
 99.900%   40.27s 
 99.990%   40.47s 
 99.999%   40.47s 
100.000%   40.47s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    9887.743     0.000000            4         1.00
   13598.719     0.100000         3395         1.11
   14671.871     0.200000         6758         1.25
   16334.847     0.300000        10130         1.43
   20496.383     0.400000        13501         1.67
   26411.007     0.500000        16879         2.00
   29229.055     0.550000        18564         2.22
   30523.391     0.600000        20253         2.50
   31391.743     0.650000        21973         2.86
   32751.615     0.700000        23633         3.33
   34439.167     0.750000        25351         4.00
   35094.527     0.775000        26179         4.44
   35717.119     0.800000        27013         5.00
   36241.407     0.825000        27858         5.71
   36700.159     0.850000        28716         6.67
   37158.911     0.875000        29598         8.00
   37355.519     0.887500        29982         8.89
   37552.127     0.900000        30442        10.00
   37715.967     0.912500        30837        11.43
   37912.575     0.925000        31241        13.33
   38109.183     0.937500        31661        16.00
   38207.487     0.943750        31861        17.78
   38305.791     0.950000        32065        20.00
   38436.863     0.956250        32294        22.86
   38567.935     0.962500        32508        26.67
   38731.775     0.968750        32740        32.00
   38797.311     0.971875        32811        35.56
   38895.615     0.975000        32930        40.00
   38993.919     0.978125        33032        45.71
   39092.223     0.981250        33140        53.33
   39190.527     0.984375        33224        64.00
   39256.063     0.985938        33281        71.11
   39354.367     0.987500        33342        80.00
   39419.903     0.989062        33398        91.43
   39518.207     0.990625        33445       106.67
   39616.511     0.992188        33498       128.00
   39649.279     0.992969        33516       142.22
   39714.815     0.993750        33547       160.00
   39780.351     0.994531        33569       182.86
   39845.887     0.995313        33600       213.33
   39911.423     0.996094        33625       256.00
   39944.191     0.996484        33635       284.44
   40009.727     0.996875        33657       320.00
   40042.495     0.997266        33668       365.71
   40075.263     0.997656        33677       426.67
   40108.031     0.998047        33689       512.00
   40140.799     0.998242        33696       568.89
   40173.567     0.998437        33704       640.00
   40206.335     0.998633        33706       731.43
   40239.103     0.998828        33713       853.33
   40304.639     0.999023        33721      1024.00
   40337.407     0.999121        33728      1137.78
   40337.407     0.999219        33728      1280.00
   40337.407     0.999316        33728      1462.86
   40370.175     0.999414        33734      1706.67
   40402.943     0.999512        33740      2048.00
   40402.943     0.999561        33740      2275.56
   40402.943     0.999609        33740      2560.00
   40402.943     0.999658        33740      2925.71
   40435.711     0.999707        33747      3413.33
   40435.711     0.999756        33747      4096.00
   40435.711     0.999780        33747      4551.11
   40435.711     0.999805        33747      5120.00
   40435.711     0.999829        33747      5851.43
   40435.711     0.999854        33747      6826.67
   40435.711     0.999878        33747      8192.00
   40468.479     0.999890        33751      9102.22
   40468.479     1.000000        33751          inf
#[Mean    =    25290.985, StdDeviation   =     9472.174]
#[Max     =    40435.712, Total count    =        33751]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  39400 requests in 1.00m, 213.77MB read
Requests/sec:    656.62
Transfer/sec:      3.56MB